

// 张树垚 2014-11-25 16:01:32 创建
// 宝马经销商列表
// 省 -> 市 -> 经销商

// HTML结构 -- name固定
// '<form action="" id="form">'
//  '<select name="province"></select>'
//  '<select name="city"></select>'
//  '<select name="dealer"></select>'
// '</form>'
// '<option value="-1">请选择 省</option>' -- 默认value是"-1"

// 用法
// 1.直接用：
// $.address("#form");
// 2.require：
// require(["address-zepto"],function(address) {
//  address("#form");
// });

// 第二个参数：选择要打印出的省份
// $.address("#form",["河北","河南"])

(function($) {
    var dealer = {
        "黑龙江": {
            "大庆": ["大庆世腾骏兴汽车销售服务有限公司:S723022","大庆世腾汽车销售有限公司:S723016","大庆名派汽车销售服务有限公司:S723030"],
            "哈尔滨": ["哈尔滨诚杰汽车销售有限公司:S723024","黑龙江运通俊业汽车销售服务有限公司:S723009","黑龙江博远汽车维修有限公司:S723012","哈尔滨中汽汽贸汽车销售服务有限公司:S723019","黑龙江龙海汽车销售集团有限公司:S723023","哈尔滨一汽森华汽车贸易有限公司:S923002","黑龙江龙海博众汽车销售服务有限公司:S223003"],
            "绥化": ["黑龙江龙众汽车销售服务有限公司:S723025"],
            "牡丹江": ["牡丹江中信汽车销售服务有限责任公司:S723014"],
            "佳木斯": ["佳木斯安诚轿车销售服务有限公司:S723015"],
            "鸡西": ["鸡西市英华进口汽车服务有限公司:S723020"],
            "齐齐哈尔": ["齐齐哈尔粤华轿车销售有限公司:S723021"],
            "鹤岗": ["鹤岗骏达汽车销售有限公司:S723026"],
            "齐齐哈尔": ["齐齐哈尔华明晟通汽车销售有限公司:S723027"],
            "双鸭山": ["双鸭山安诚汽车销售服务有限公司:S723028"],
            "大兴安岭地区": ["大兴安岭龙海兴众汽车销售服务有限公司:S723029"],
            "黑河": ["北安市粤华汽车销售有限公司:S723031"],
            "佳木斯": ["富锦安诚汽车销售服务有限公司:S223001"],
            "伊春": ["伊春龙海德众汽车销售有限公司:S223002"]
        },
        "吉林": {
            "长春": ["长春汇腾汽车销售服务有限公司:S722032","长春瑞骐汽车销售服务有限公司:S722035","长春一汽实业众捷汽车销售有限公司:S722039","吉林省华之诚汽车销售服务有限公司:S722028","吉林省久恒汽车销售服务有限公司:S722057","长春禾根汽车销售有限公司:S722038","吉林省华之诚世达汽车销售服务有限公司:S722041","吉林省驰恒汽车销售服务有限公司:S722037","吉林省吉刚汽车贸易有限公司:S722005","长春市华阳汽车贸易有限责任公司:S722017","长春通立汽车商贸有限公司:S722030","长春通立德众汽车服务有限公司:S722044"],
            "吉林": ["吉林市神洲大众汽车销售服务有限公司:S722033","吉林市神华大众汽车服务有限责任公司:S722002"],
            "松原": ["松原汇众汽车销售服务有限公司:S722040","吉林石油装备汽车销售维修服务有限公司:S722027"],
            "白城": ["白城汇众汽车销售服务有限公司:S722058"],
            "榆树": ["吉林省驰久汽车销售服务有限公司:S222003"],
            "白山": ["白山市众合汽车销售维修有限公司:S722026"],
            "四平": ["四平汇众汽车销售服务有限公司:S722036"],
            "延边朝鲜族自治州": ["延吉中诚汽车贸易有限公司:S722021"],
            "通化": ["通化鑫宇汽车销售有限公司:S722023"],
            "双辽": ["双辽汇众汽车销售服务有限公司:S222002"],
            "辽源": ["辽源市聚鑫汽车销售服务有限公司:S722059"]
        },
        "辽宁": {
            "铁岭": ["铁岭市顺峰（集团）汽车销售服务有限公司:S721028","铁岭和成汽车销售服务有限公司:S721034"],
            "沈阳": ["沈阳和昊汽车销售服务有限公司:S721031","沈阳市庞大一众汽车销售有限公司:S721037","辽宁惠华汽车集团有限公司:S721024","沈阳合众汽车服务有限公司:S721025","辽宁和兴大众汽车销售服务有限公司:S921003","沈阳惠华新业汽车销售服务有限公司:S221001","辽宁惠华新业集团新民汽车销售服务有限公司:S221002","辽宁惠华新业集团辽中汽车销售服务有限公司:S221003"],
            "抚顺": ["抚顺和昆汽车销售服务有限公司:S721035"],
            "本溪": ["辽宁惠华集团本溪汽车销售服务有限公司:S721039"],
            "丹东": ["丹东曙光新天地汽车销售服务有限公司:S721044"],
            "阜新": ["阜新和利汽车销售服务有限公司:S721036","阜新永生工贸发展有限公司:S721007"],
            "朝阳": ["辽宁惠华集团朝阳汽车销售服务有限公司:S721038"],
            "葫芦岛": ["葫芦岛市维立达汽车服务有限公司:S721013"],
            "锦州": ["锦州通用汽车销售服务有限公司:S721019"],
            "盘锦": ["盘锦隆达汽车产品销售服务有限公司:S721030"],
            "鞍山": ["鞍山谛赢汽车销售服务有限公司:S721032","鞍山市中田汽车贸易有限公司:S921017"],
            "辽阳": ["辽阳凯众汽车销售服务有限公司:S721033","灯塔凯祥汽车销售服务有限公司:S221004"],
            "大连": ["大连通孚祥汽车贸易有限公司:S721029","大连弘鼎汽车销售服务有限公司:S721041","大连禾众汽车销售服务有限公司:S721040","大连捷仕达汽车销售服务有限公司:S721016","瓦房店市顺发物资商贸有限公司:S721018","大连汽贸集团汽车销售服务有限公司:S921002","大连中联伟业汽车销售有限公司:S721043"],
            "营口": ["营口盛世悦众汽车销售服务有限公司:S721042","营口红运汇众汽车销售服务有限公司:S721027"]
        },
        "内蒙古": {
            "呼伦贝尔": ["呼伦贝尔市华通汽车销售有限公司:S715016"],
            "通辽": ["通辽市利丰泰宇汽车销售服务有限公司:S715034","通辽庞大一众汽车销售服务有限公司:S715029"],
            "呼和浩特": ["内蒙古利丰泰宇汽车服务有限公司:S715021","呼和浩特市庞大一众汽车销售服务有限公司:S715027","内蒙古亿阳汇众汽车销售有限公司:S715014","内蒙古众和汽车销售服务有限公司:S715023"],
            "锡林郭勒盟": ["锡林浩特庞大一众汽车销售服务有限公司:S715028"],
            "乌兰察布": ["乌兰察布市捷通众达汽车销售服务有限公司:S715026"],
            "兴安盟": ["兴安盟利丰泰宇汽车销售有限公司:S715030"],
            "赤峰": ["赤峰坤驰汽车销售服务有限公司:S715032","赤峰凯富达汽车服务有限公司:S715011","赤峰隆瑞商贸有限公司:S215003"],
            "鄂尔多斯": ["鄂尔多斯市鑫安汽车贸易服务有限责任公司:S715017","鄂尔多斯市鑫安基业汽车销售有限责任公司:S715015","乌审旗鑫安亿恒汽车销售有限责任公司:S215001"],
            "巴彦淖尔": ["巴彦淖尔市航海汽车销售服务有限公司:S715020"],
            "乌海": ["乌海市鑫安众诚汽贸有限公司:S715022"],
            "包头": ["包头市惠众汽车服务有限公司:S715033","包头市东信泰德汽车销售服务有限公司:S715031","包头庞大一众汽车销售服务有限公司:S715025","包头德众汽车服务有限公司:S715009"]
        },
        "北京": {
            "北京": ["北京鑫万维富达汽车销售有限公司:S711046","北京联拓通达汽车销售服务有限公司:S711050","北京上地四方汽车销售服务有限公司:S711052","北京海联力捷汽车销售服务有限公司:S711058","北京海联力通经贸有限公司:S711002","北京鑫万维汽车经贸有限公司:S711029","北京拓展工贸发展有限公司:S911025","北京市天达汽车修理有限公司:S711033","北京德奥达一众汽车销售有限公司:S711043","北京博瑞祥泰汽车销售服务有限公司:S711053","北京友联威科汽车销售服务有限公司:S711028","北京联拓亿众汽车服务有限公司:S711056","北京运通兴恩汽车销售服务有限公司:S711051","北京运通博恩汽车销售服务有限公司:S711021","北京北方华驿车辆销售服务有限公司:S711034","大众汽车服务中心（北京）有限公司:S711038","北京庆洋惠众汽车服务有限公司:S711061","北京长久博众汽车销售服务有限公司:S711060","北京庆洋汽车服务有限公司:S711012","北京骏宝威汽车贸易有限公司:S711023","北京冀东丰汽车销售服务有限公司:S711032","北京首汽腾鹏汽车销售服务有限公司:S711030","北京东仁金舆汽车销售服务有限公司:S711036","北京亚之杰伯乐汽车销售服务有限公司:S711048","北京运通嘉恩汽车销售服务有限公司:S711059","北京汽车贸易中心有限公司:S711042","北京博瑞祥弘汽车销售服务有限公司:S711055","北京华昌汽车销售服务有限公司:S911028","北京华信宏业商贸有限公司:S711039","北京捷亚泰中盛汽车销售有限公司:S711047","北京捷亚泰中兴汽车销售有限公司:S711049","北京捷亚泰万兴汽车销售有限公司:S711057","北京东方华正汽车销售服务有限公司:S711010","北京市良乡万达工贸有限公司:S711017","北京硕川汽车销售服务有限公司:S711024","北京博瑞祥恒汽车销售有限公司:S711054","北京捷亚泰汽贸有限公司:S911029","北京鑫港汇众汽车销售服务有限公司:S711062"]
        },
        "天津": {
            "天津": ["天津市捷兴汽车商贸有限公司:S712005","天津捷众汽车销售有限公司:S712006","天津诚信通汽车销售有限公司:S712007","天津庞大一众汽车销售服务有限公司:S712008","天津捷锐汽车销售有限公司:S712010","天津捷拓汽车销售服务有限公司:S712015","天津市捷世通汽车贸易有限公司:S712003","天津浩众汽车贸易服务有限公司:S712004","天津捷通汽车销售有限公司:S912003","天津海联力通汽车销售服务有限公司:S712009","天津市澎众汽车贸易服务有限公司:S712013","天津华泰通汽车销售有限公司:S712011","天津市捷茂通汽车销售有限公司:S712012","天津博兴亚泰汽车销售服务有限公司:S712014","天津华世通汽车销售有限公司:S253001"]
        },
        "河北": {
            "张家口": ["张家口市庞大一众汽车销售有限公司:S713031","张家口市庞大众腾汽车销售有限公司:S713050"],
            "保定": ["保定市朗尊汽车销售服务有限公司:S713038","保定市中冀汽车贸易集团有限公司:S713017","保定轩宇俊鹏汽车销售服务有限公司:S713032","保定市耀达正博汽车销售服务有限公司:S713053","高碑店市新海轿车销售有限公司:S213011"],
            "石家庄": ["石家庄市庞大一众汽车销售有限公司:S713039","石家庄晨阳和众汽车贸易有限公司:S713042","河北世纪汽车贸易有限公司:S713011","石家庄晨阳汽车贸易有限公司:S713018","河北众捷汽车贸易有限公司:S713025","石家庄市冀中汽车贸易有限公司:S713027","石家庄晨阳详云汽车贸易有限公司:S713058","辛集市车是客汽车贸易有限公司:S713057","石家庄晨阳博众汽车贸易有限公司:S213016","石家庄晨阳汇众汽车贸易有限公司:S213017"],
            "定州": ["定州轩宇俊鹏汽车销售服务有限公司:S713054"],
            "秦皇岛": ["秦皇岛市庞大一众汽车销售有限公司:S713029","秦皇岛新源汽车销售维修有限公司:S713004","青龙满族自治县庞大一众汽车销售有限公司:S213005"],
            "承德": ["承德市庞大一众汽车销售有限公司:S713030"],
            "唐山": ["遵化市庞大一众汽车销售有限公司:S713037","唐山市庞大一众汽车销售有限公司:S713034","迁安市庞大一众汽车销售有限公司:S713036","滦县庞大一众汽车销售有限公司:S713049","唐山市庞大众跃汽车销售服务有限公司:S713045","唐山市冀东汽车销售有限公司:S713005","唐山朗基伦汽车销售有限公司:S713016","玉田县庞大一众汽车销售有限公司:S713051","唐山市富瑞汽车贸易有限公司:S713056","滦南荣川朗基伦汽车销售有限公司:S213006","乐亭县荣川朗基伦汽车销售有限公司:S213014"],
            "廊坊": ["廊坊市庞大一众汽车销售服务有限公司:S713044","廊坊市冀东汽车销售有限公司:S713009","霸州市云海汽车销售服务有限公司:S713059","三河巨丰弘迪汽车维修服务有限公司:S213003","大城县亿龙汽车销售有限公司:S213012"],
            "邯郸": ["邯郸市华迈汽车销售服务有限公司:S713033","邯郸市顺达汽车贸易有限公司:S713020","邯郸市华信泰达汽车贸易有限公司:S713026","邯郸市华信进贤汽车贸易有限公司:S713041","邯郸市华锦汽车销售服务有限公司:S713048","邯郸市帅祺汽车贸易有限公司:S213001","永年县瑞龙汽车销售服务有限公司:S213013","磁县万合汽车贸易有限公司:S213015"],
            "邢台": ["邢台瑞龙汽车服务有限公司:S713035","邢台亿龙汽车销售服务有限公司:S713022","邢台阔龙汽车销售服务有限公司:S713043","清河县惠龙汽车销售服务有限公司:S213018"],
            "衡水": ["衡水瑞龙汽车销售服务有限公司:S713047","衡水烨通汽贸有限公司:S713019","衡水恒德安发汽车销售有限公司:S213002","衡水阔龙汽车销售服务有限公司:S213008"],
            "沧州": ["沧州庞大一众汽车销售有限公司:S713046","沧州运通汽车销售服务有限公司:S713021","任丘市瑞丰建筑有限公司:S913006","黄骅市前进汽车服务有限公司:S713055","沧州市瑞华汽车贸易有限公司:S713052","泊头市运东汽车销售服务有限公司:S213019"],
            "河间": ["河间市润众达汽车销售服务有限公司:S213007"]
        },
        "山西": {
            "忻州": ["山西信鹏汽车销售服务有限公司:S714018"],
            "阳泉": ["阳泉市庞大一众汽车销售有限公司:S714022","盂县鑫众汽车销售有限公司:S214001"],
            "长治": ["长治市中天汽车销售服务有限公司:S714023","山西省长治市飞路汽车贸易有限公司:S714013"],
            "吕梁": ["山西吕梁大昌众达汽车服务有限公司:S714024"],
            "大同": ["庞大大同南郊一众汽车销售有限公司:S714025","大同市谷氏车城汽车连锁销售有限公司:S714014"],
            "太原": ["山西大昌通源汽车销售服务有限公司:S714026","山西志国星赛车发展有限公司:S714009","山西中汽贸联汽车销售有限公司:S714016","山西大昌轿车销售服务有限公司:S714019"],
            "晋城": ["晋城市唐荣实业有限公司:S714010"],
            "朔州": ["朔州市双良汽车有限公司:S714017"],
            "运城": ["运城市通达汽车销售服务有限公司:S714021","山西诺维兰集团运城瑞众汽车销售服务有限公司:S714028","山西诺维兰集团河津市瑞腾汽车销售服务有限公司:S214003","山西诺维兰集团临猗瑞捷汽车销售服务有限公司:S214002"],
            "晋中": ["晋中航成轿车销售服务有限公司:S714027"],
            "临汾": ["临汾天健国风汽车销售服务有限公司:S714030"],
            "孝义": ["孝义市德众汽贸有限公司:S214004"]
        },
        "山东": {
            "济南": ["山东首佳汽车销售服务有限公司:S737061","山东金宝利汽车销售服务有限公司:S737071","山东银座汽车贸易有限公司:S637009","山东润捷汽车销售服务有限公司:S737050","济南庞大一众汽车销售服务有限公司:S737084"],
            "滨州": ["滨州腾翔汽车销售服务有限公司:S737072","山东滨州宝捷汽车销售服务有限公司:S737051","山东无棣腾翔汽车销售服务有限公司:S237002","滨州泰通汽车销售服务有限公司:S237017"],
            "德州": ["德州汇众汽车销售技术服务有限公司:S737030","德州华运汽贸销售服务有限公司:S737048","齐河华腾汽车销售有限公司:S237001","夏津汇达汽车销售有限公司:S237012"],
            "东营": ["东营华锐汽车销售有限公司:S737062","山东广饶腾翔汽车销售服务有限公司:S737093"],
            "乐陵": ["乐陵市鑫众汽车销售服务有限公司:S237013"],
            "泰安": ["新泰市创新汽车服务有限公司:S737057","泰安仁博汽车销售有限公司:S737080","泰安中租汽车贸易有限公司:S737035","肥城市创伟汽车服务有限公司:S237016"],
            "聊城": ["聊城北斗泰众汽车销售有限公司:S737075","聊城交运集团汽车销售服务有限责任公司:S737038","茌平德众汽车销售服务有限公司:S737088"],
            "济宁": ["济宁众诚汽车销售服务有限公司:S737058","济宁世盛汽车销售服务有限公司:S737076","济宁市长济汽车贸易有限公司:S737031","济宁交运怡丰汽车销售服务有限公司:S737087"],
            "菏泽": ["菏泽交通集团有限公司:S737085","菏泽金江车业有限公司:S737086","郓城德众汽车销售服务有限公司:S237019"],
            "莱芜": ["莱芜泰通汽车销售服务有限公司:S737037"],
            "潍坊": ["青州宝悦汽车销售服务有限公司:S737065","寿光富泓汽车销售服务有限公司:S737068","诸城市永邦汽车服务有限公司:S737066","临朐广潍顺达汽车销售服务有限公司:S737078","高密市经贸汽车销售有限公司:S737028","潍坊市鑫达汽车贸易有限公司:S737036","潍坊广潍发达商贸有限公司:S737039","昌邑广潍金达汽车销售服务有限公司:S737089","安丘广利汽车贸易有限公司:S737095"],
            "淄博": ["淄博唯达长齐汽车销售有限公司:S737069","淄博骏泰汽车销售服务有限公司:S737079","淄博市久期汽车销售有限公司:S737015","淄博众信汽车销售服务有限公司:S737040"],
            "淄博": ["淄博捷通汽车销售服务有限公司:S237021"],
            "临沂": ["临沂东华汽车销售服务有限公司:S737067","临沂久华汽车销售服务有限公司:S737081","临沂佳轮汽车销售服务有限公司:S737029","临沂大华汽车销售服务有限公司:S737064","兰陵大华汽车销售服务有限公司:S237022","临沭东华汽车销售服务有限公司:S237005","费县大华汽车销售服务有限公司:S237003","郯城大华汽车销售服务有限公司:S237004","沂南大华汽车销售服务有限公司:S237008","沂水大华汽车销售服务有限公司:S237011","平邑大华汽车销售服务有限公司:S237010"],
            "枣庄": ["山东永正集团东联汽车城有限公司:S737070","枣庄永明汽车销售服务有限公司:S737097"],
            "日照": ["日照市腾达众晟汽车销售服务有限公司:S737082","日照市众达汽车销售服务有限公司:S737073","莒县众合汽车销售服务有限公司:S237014"],
            "青岛": ["青岛迪生源汽车销售服务有限公司:S737054","青岛亨通汽车销售服务有限公司:S737053","青岛大栏汽车销售有限公司:S737032","青岛华世通实业发展有限公司:S737059","青岛庞大一众汽车销售有限公司:S737083","青岛亨联汽车销售有限公司:S737090","青岛瑞辰汽车销售服务有限公司:S737094","青岛莱西市瑞富春汽车销售服务有限公司:S237007"],
            "威海": ["威海中升汇众汽车销售服务有限公司:S737098","荣成市众奥达汽车销售服务有限公司:S737077","乳山中升汇众汽车销售服务有限公司:S237015"],
            "烟台": ["莱州市鸿富汽车经销有限公司:S737006","烟台东联汽车销售有限公司:S737016","山东龙口富龙汽车有限公司:S737017","烟台市大成汽车销售有限公司:S737018","招远市天城汽车维修有限公司:S737042","烟台瑞源汽车销售有限公司:S737043","海阳市瑞富春汽车销售服务有限公司:S237009"]
        },
        "河南": {
            "郑州": ["河南润众实业有限公司:S741022","河南合众明德汽车销售服务有限公司:S741031","河南万通一汽贸易有限公司:S741004","河南裕华奥捷汽车销售服务有限公司:S741008","河南豫港华翔汽车销售服务有限公司:S741012","河南合众汇金实业有限公司:S741018","郑州东佳汽车销售服务有限责任公司:S741033","巩义合众汇金汽车销售服务有限公司:S741036","新密恒信众联汽车销售服务有限公司:S741041","郑州庞大一众汽车销售有限公司:S241003"],
            "鹤壁": ["鹤壁维尔娜汽车销售有限公司:S741029"],
            "新乡": ["新乡市世通汽车贸易有限责任公司:S741009","新乡市坤丰汽车销售有限公司:S741032","长垣世通汽车贸易有限公司:S241002","辉县市世通汽车销售有限公司:S241009"],
            "焦作": ["焦作市云洲汽车贸易有限公司:S741010","焦作国安汽车有限公司:S741039","济源市永嘉汽车销售有限公司:S741040"],
            "安阳": ["安阳市宝捷汽车贸易有限责任公司:S741013","安阳市世达汽车销售服务有限公司:S741030","滑县锦程汽车销售服务有限公司:S241008"],
            "濮阳": ["濮阳市宝捷汽车销售服务有限公司:S741015"],
            "开封": ["开封市万宝汽车贸易有限公司:S741016","开封万宝汽车销售服务有限公司:S741037"],
            "林州": ["林州德众汽车销售服务有限公司:S241007"],
            "商丘": ["商丘市众捷汽车销售有限公司:S841002","永城市华瑞汽车销售有限公司:S241004","虞城县众捷汽车贸易物流有限公司:S241006"],
            "驻马店": ["驻马店市和美汽车销售服务有限公司:S741024"],
            "平顶山": ["平顶山市华天汽车销售服务有限公司:S741020","平顶山吉祥地汽车销售有限公司:S741035"],
            "周口": ["周口市和荣汽车销售服务有限公司:S741026"],
            "南阳": ["南阳众业汽车有限公司:S741027"],
            "三门峡": ["三门峡九都汽车有限公司:S741025","灵宝众诚汽车销售服务有限公司:S741042"],
            "信阳": ["信阳合众汇金汽车销售服务有限公司:S741028"],
            "洛阳": ["洛阳开元汽车销售服务有限公司:S741023","洛阳伯乐汽车有限公司:S741005","洛阳吉众汽车有限公司:S741034","洛阳盛业汽车有限公司:S241001"],
            "漯河": ["漯河市宝捷汽车销售服务有限公司:S741011"],
            "许昌": ["许昌恒业汽车销售有限公司:S741014","长葛市恒业汽车销售有限公司:S241005","禹州恒业汽车销售有限公司:S241010"]
        },
        "湖北": {
            "黄石": ["黄石市大桥汽车服务有限公司:S942022"],
            "孝感": ["孝感国富汽车销售服务有限公司:S942026"],
            "咸宁": ["咸宁恒信众联汽车销售服务有限公司:S942028"],
            "黄冈": ["黄冈恒信众联汽车销售服务有限公司:S942030"],
            "武汉": ["武汉富尔汽车销售服务有限公司:S942032","武汉一通汽车销售服务有限公司:S942015","武汉康顺集团汽车贸易有限公司:S942016","湖北东富汽车工贸有限公司:S942017","武汉恒信众联汽车销售服务有限公司:S942034","武汉东富优诚汽车销售服务有限公司:S942036"],
            "鄂州": ["鄂州锦坤汽车销售服务有限公司:S942038"],
            "潜江": ["潜江恒信众联汽车销售服务有限公司:S242002"],
            "宜昌": ["宜昌德顺汽车销售服务有限公司:S942023","宜昌都顺汽车贸易有限公司:S242001"],
            "荆州": ["荆州市恒信一路汽车销售服务有限公司:S942024"],
            "十堰": ["湖北十堰东富汽车销售服务有限公司:S942027"],
            "恩施": ["恩施恒信众联汽车销售服务有限公司:S942025"],
            "荆门": ["荆门恒信众联汽车销售服务有限公司:S942029"],
            "襄阳": ["襄阳恒信众联汽车销售服务有限公司:S942035","襄阳华骏汽车销售服务有限公司:S942031"],
            "随州": ["随州东富汽车销售服务有限公司:S942037"]
        },
        "上海": {
            "上海": ["上海金旋汽车服务有限公司:S732053","上海永达豪捷汽车销售服务有限公司:S732056","上海锦腾汽车销售服务有限公司:S931015","上海虹湾贸易有限公司:S931013","上海慕森汽车销售服务有限公司:S931014","上海交运起申汽车销售服务有限公司:S931016","上海一汽汽车服务有限公司:S931002","上海嘉安汽车销售有限公司:S931005","上海永达汽车浦东贸易有限公司:S931007","上海开隆汽车服务有限公司:S931008","上海宝乐汽车销售服务有限公司:S931011","上海华星众捷汽车销售有限公司:S931012","上海东联北松汽车销售服务有限公司:S931017","上海永达众鑫汽车销售服务有限公司:S931018","上海华星鸿捷汽车销售服务有限公司:S931020"]
        },
        "江苏": {
            "常州": ["常州市上瑞汽车销售服务有限公司:S732052","溧阳宝达汽车销售服务有限公司:S732067","常州国际汽车城有限公司:S732029","常州宝达汽车销售服务有限公司:S732038","常州外汽东进汽车销售服务有限公司:S732072","金坛宝达汽车销售服务有限公司:S732079"],
            "镇江": ["江苏德大汽车有限公司:S732059","江苏华跃汽车有限公司:S732031","镇江德豪汽车有限公司:S732071"],
            "无锡": ["无锡宝达汽车销售服务有限公司:S732068","无锡东方荣昌汽车销售服务有限公司:S732007","无锡市新纪元众友汽车销售服务有限公司:S732040","宜兴市广海元汽车销售服务有限公司:S732043","江阴市全顺海宏汽车销售服务有限公司:S732045","无锡申荣汽车有限公司:S932018","宜兴新东方汽车销售服务有限公司:S732084","江阴市海隆汽车销售服务有限公司:S732083"],
            "宿迁": ["宿迁大中汽车服务有限公司:S732046","沭阳大中汽车服务有限公司:S232003","宿迁中瑞汽车服务有限公司:S232014"],
            "淮安": ["淮安康润汽车销售服务有限公司:S732055","淮安驰祥汽车销售服务有限公司:S232009"],
            "徐州": ["徐州金源汽车服务有限公司:S732058","徐州金茂汽车贸易有限公司:S732033","徐州联和恒顺汽车销售服务有限公司:S732074","徐州金泉汽车贸易有限公司:S232001","徐州金宇汽车贸易有限公司:S232002","新沂大中汽车贸易有限公司:S232013"],
            "扬州": ["江苏金太阳汽车销售服务有限公司:S732037","扬州金通汽车销售服务有限公司:S732065","江苏金太阳瑞众汽车贸易有限公司:S732078","扬州金沪汽车销售服务有限公司:S232006","扬州金迈汽车销售服务有限公司:S232007"],
            "南京": ["南京协众东麒汽车有限公司:S732051","南京朗驰集团苏润汽车销售服务有限公司:S732021","江苏苏舜华德汽车销售服务有限公司:S732028","南京协众汽车有限公司:S732047","江苏华海南众汽车销售有限公司:S732066","南京协众瑞东汽车有限公司:S732069","南京东连香江汽车销售服务有限公司:S732082","南京江北协众汽车销售服务有限公司:S732087","南京溧水协众汽车销售服务有限公司:S232015"],
            "苏州": ["苏州汇凯汽车贸易有限公司:S732036","苏州市德宝车业有限公司:S732054","太仓市森联汽车销售服务有限公司:S732060","常熟德润汽车销售服务有限公司:S732070","常熟市众成汽车销售有限公司:S732015","昆山锦隆汽车贸易有限公司:S732019","苏州欧亚伟业实业有限公司:S732023","张家港市汇众汽车销售有限公司:S732041","苏州市国懋汽车销售服务有限公司:S932014","苏州德诚汽车销售服务有限公司:S732080","苏州元通汽车销售服务有限公司:S732085"],
            "南通": ["南通鑫湖汽车贸易服务有限公司:S732050","海门常和大众汽车销售服务有限公司:S732049","南通文峰伟嘉汽车销售服务有限公司:S732062","如皋神州汽车销售服务有限公司:S732064","南通新城集团有限公司:S732048","南通大生众和汽车销售服务有限公司:S732063","启东常众文峰汽车销售服务有限公司:S732077","如东德众汽车销售服务有限公司:S732081","海安德品汽车有限公司:S732086"],
            "泰州": ["泰州金太阳汽车贸易有限公司:S732057","泰州金翱汽车销售服务有限公司:S732075","泰州金坤汽车销售服务有限公司:S732076","泰州金邦汽车销售服务有限公司:S232005","泰州金浦汽车销售服务有限公司:S232004"],
            "盐城": ["江苏中联汽车销售服务有限公司:S732025","盐城鑫湖贸易有限公司:S732061","东台宝达汽车销售服务有限公司:S232012","射阳宝达汽车销售服务有限公司:S232016"],
            "连云港": ["连云港康华汽车销售服务有限公司:S732032","连云港康瑞汽车销售服务有限公司:S732073","连云港康瀛汽车销售有限公司:S232008","连云港康泽汽车销售有限公司:S232011","连云港康锦汽车销售有限公司:S232010"]
        },
        "浙江": {
            "杭州": ["杭州百年汽车销售服务有限公司:S733039","杭州百瑞汽车有限公司:S733048","杭州元通宝通汽车有限公司:S733076","临安元通宝通汽车有限公司:S733061","浙江一汽汽车销售服务有限公司:S733003","浙江元通宝通汽车有限公司:S733077","浙江省直汽车销售服务有限公司:S733034","浙江百腾汽车有限公司:S733071","富阳市腾远汽车有限公司:S733078","桐庐元通汽车有限公司:S233001","杭州康桥新之众汽车有限公司:S233006"],
            "嘉兴": ["桐乡博众汽车销售有限公司:S733046","海宁市群英汽车销售服务有限公司:S733049","嘉兴市北方汽车贸易有限公司:S733008","嘉善源通汽车销售服务有限公司:S733074"],
            "湖州": ["湖州众腾汽车销售服务有限公司:S733044","湖州长运汽车销售服务有限公司:S733031","长兴元通汽车有限公司:S733068"],
            "绍兴": ["诸暨元通汽车有限公司:S733075","绍兴市汇丰汽车销售服务有限公司:S733041","上虞清风汽车销售服务有限公司:S733045","绍兴清风汽车销售服务有限公司:S733028","嵊州市龙骏汽车销售服务有限公司:S733062","新昌县越达汽车有限公司:S233002"],
            "衢州": ["衢州祥龙汽车有限公司:S733043"],
            "金华": ["金华宝通汽车有限公司:S733057","东阳市众富汽车销售服务有限公司:S733053","永康市华奥汽车销售服务有限公司:S733054","义乌市恒通汽车销售服务有限公司:S733019","金华金奥汽车销售服务有限公司:S933007"],
            "衢州": ["江山祥宇汽车有限公司:S233003"],
            "舟山": ["舟山市霁锐汽车销售服务有限公司:S733050"],
            "宁波": ["象山华恒汽车销售服务有限公司:S733056","宁波明众汽车销售服务有限公司:S733059","宁波联合汽车销售服务有限公司:S733011","宁波元通宝通汽车有限公司:S733079","慈溪市华泰汽车服务有限公司:S733037","余姚宇顺汽车销售服务有限公司:S733038","宁波市康发汽车销售服务有限公司:S733042","宁波中基甬耀汽车销售服务有限公司:S733047","奉化轿辰康发汽车销售服务有限公司:S733067","宁波轿辰康嘉汽车销售服务有限公司:S733065","慈溪市锦星汽车销售服务有限公司:S733064"],
            "温州": ["温州市宝捷汽车销售有限公司:S733024","苍南轿辰康发汽车销售服务有限公司:S733058","温州市瓯海荣新汽车修配有限公司:S733010","瑞安市国荣汽车维修服务有限公司:S733014","温州华科欧龙汽车销售服务有限公司:S733018","温州国瑞汽车销售服务有限公司:S733060","温州欧龙汽车有限公司:S733069"],
            "台州": ["温岭市金桥汽车销售服务有限公司:S733036","台州市汇腾汽车销售服务有限公司:S733052","台州轿辰康发汽车销售服务有限公司:S733055","台州金桥汽车销售服务有限公司:S733040","台州康桥众致汽车有限公司:S233004"],
            "丽水": ["丽水市恒昌汽车有限公司:S733027","丽水市瓯迪汽车销售服务有限公司:S733063"]
        },
        "安徽": {
            "合肥": ["合肥欧亚汽车服务有限公司:S734016","巢湖亚宝汽车销售服务有限公司:S734020","安徽孚迪汽车销售有限公司:S734009","安徽众力汽车销售服务有限公司:S734014","安徽宝捷汽车销售服务有限公司:S734011"],
            "宣城": ["宣城亚宝汽车销售服务有限公司:S734019","宁国亚宝汽车销售服务有限公司:S234001"],
            "马鞍山": ["马鞍山协众汽车销售有限公司:S734023"],
            "铜陵": ["铜陵市海达汽车销售服务有限公司:S734024"],
            "安庆": ["安庆环众汽车销售服务有限公司:S734030"],
            "芜湖": ["芜湖亚夏汽车股份有限公司:S734012"],
            "黄山": ["黄山亚众汽车销售服务有限公司:S734026"],
            "池州": ["池州协众汽车销售服务有限公司:S734028"],
            "阜阳": ["阜阳市永鑫汽车销售服务有限公司:S734013"],
            "滁州": ["滁州金通联众汽车销售有限公司:S734015"],
            "亳州": ["亳州中源汽车销售服务有限公司:S734021"],
            "宿州": ["宿州市丽豪汽车销售服务有限公司:S734018"],
            "六安": ["六安和众汽车销售服务有限公司:S734022"],
            "蚌埠": ["蚌埠市华诚轿车销售服务有限公司:S734017"],
            "淮北": ["淮北市运昌汽车销售服务有限责任公司:S734025"],
            "淮南": ["淮南盛之杰汽车销售服务有限公司:S734027"]
        },
        "广东": {
            "韶关": ["韶关市亿华汽车贸易有限公司:S744045"],
            "广州": ["广州市健稳汽车贸易有限公司:S744048","广州市大吉汽车销售服务有限公司:S744049","广东物通溢众汽车展销中心有限公司:S744047","广州市南菱万众汽车维修服务有限公司:S744056","广州市梅花园汽车销售服务有限公司:S744015","广州市锦众汽车贸易有限公司:S744019","广东物通凯骏汽车有限公司:S744046","广东君乐汽车贸易有限公司:S944002","广州市安捷鑫众汽车有限公司:S744077","广州庞大一众汽车销售服务有限公司:S744068"],
            "清远": ["清远南方合众汽车销售服务有限公司:S744052"],
            "东莞": ["东莞市鸿众汽车销售服务有限公司:S744057","东莞市锦众汽车贸易有限公司:S744060","东莞市捷达通贸易有限公司:S744011","东莞市新大地汽车贸易有限公司:S744012","东莞市昌发汽车贸易有限公司:S744035","东莞市东深奇建汽车销售服务有限公司:S744066","东莞庞大一众汽车销售服务有限公司:S744069"],
            "深圳": ["深圳市南方腾龙汽车销售服务有限公司:S744051","深圳市北奇建贸易有限公司:S744063","深圳市安进汽车贸易有限公司:S744021","深圳市昊天林实业有限公司:S744023","深圳市奇建贸易有限公司:S944012","深圳市清水河奇建贸易有限公司:S744064","深圳市昊天林安琪汽车有限公司:S744075"],
            "揭阳": ["揭阳合和汽车销售服务有限公司:S744059"],
            "河源": ["河源市德宝汽车贸易有限公司:S744054"],
            "梅州": ["梅州市新宇汽车销售服务有限公司:S744055"],
            "惠州": ["惠州市志通恒泰汽车销售服务有限公司:S744062","惠州市大众汽车销售服务有限公司:S744014"],
            "潮州": ["潮州市通达汽车贸易有限公司:S744018"],
            "汕头": ["汕头市裕丰交通经济发展有限公司:S744024","汕头市庞大一众汽车销售服务有限公司:S744072"],
            "汕尾": ["汕尾市君乐汽车销售服务有限公司:S244001"],
            "佛山": ["佛山市英丰汽车销售服务有限公司:S744058","佛山市瀚众汽车贸易服务有限公司:S744067","佛山市合诚汽车销售服务有限公司:S744031","佛山市南海区拓华汽车贸易有限公司:S744039","佛山市顺德区世锦汽车贸易有限公司:S744050","佛山市广物君乐汽车销售服务有限公司:S744074"],
            "肇庆": ["肇庆市安迅汽车有限公司:S744061"],
            "湛江": ["湛江市正日汽车贸易有限公司:S744042"],
            "中山": ["中山市众腾汽车有限公司:S744053","中山市创世纪汽车有限公司:S744006","中山庞大一众汽车销售服务有限公司:S744076"],
            "阳江": ["阳江安捷源众汽车销售服务有限公司:S744065"],
            "江门": ["江门市新众汽车销售服务有限公司:S744040","江门市钜荣汽车销售服务有限公司:S744070"],
            "茂名": ["茂名市茂南茂汉汽车贸易有限公司:S744043"],
            "珠海": ["珠海市香洲一汽汽车销售有限公司:S944011","珠海市珠光汽车有限公司:S944017"]
        },
        "福建": {
            "三明": ["三明盈众汽车有限公司:S735021"],
            "福州": ["福州盈众汽车有限公司:S735023","福州致远汽车销售服务有限公司:S735027","福建永通达汽车贸易有限公司:S735029","福州永力通汽车贸易有限公司:S735011","福建省福京汽车贸易有限公司:S935001"],
            "南平": ["南平盈众汽车有限公司:S735024"],
            "宁德": ["宁德盈众汽车有限公司:S735025"],
            "莆田": ["莆田市奇奇贸易发展有限公司:S735012"],
            "厦门": ["厦门致远汽车有限公司:S735022","厦门君达汽车有限公司:S735026","厦门明至汽车有限公司:S735032","厦门市盈众汽车销售有限公司:S735007"],
            "漳州": ["漳州致远汽车有限公司:S735030","漳州盈众汽车销售服务有限公司:S735020"],
            "龙岩": ["龙岩盈众汽车有限公司:S735031","龙岩市众邦汽车贸易有限公司:S735015"],
            "泉州": ["晋江市金阳汽车销售有限公司:S735017","泉州盈众汽车销售服务有限公司:S735019","泉州大众汽车销售服务有限公司:S935010","南安盈众汽车销售服务有限公司:S735033","惠安盈众汽车销售服务有限公司:S235002","安溪华迪汽车销售服务有限公司:S235001"]
        },
        "江西": {
            "上饶": ["上饶市欧亚汽车销售有限公司:S736012"],
            "赣州": ["赣州金涛汽车销售服务有限公司:S736013","赣州欧亚汽车销售有限公司:S736016"],
            "吉安": ["吉安欧亚汽车销售有限公司:S736014"],
            "南昌": ["南昌欧亚汽车销售有限公司:S736005","江西华宏名众汽车有限公司:S736017","江西协众汽车发展有限公司:S936005","南昌恒信一路汽车销售服务有限公司:S736024"],
            "九江": ["九江宏达汽车贸易有限公司:S736007","九江九源汽车销售服务有限公司:S736020"],
            "宜春": ["江西佳辉汽车贸易服务有限公司:S736008"],
            "萍乡": ["萍乡市永安昌荣实业有限公司:S736022"],
            "景德镇": ["景德镇欧亚汽车销售有限公司:S736015"],
            "鹰潭": ["鹰潭华宏汽车有限公司:S736021"]
        },
        "湖南": {
            "永州": ["湖南省永州市永恒汽车贸易有限公司:S743015"],
            "娄底": ["娄底大汉汽车贸易有限公司:S743018"],
            "长沙": ["湖南中拓瑞众汽车销售服务有限公司:S743016","湖南华洋汽车贸易有限公司:S743009","湖南汽车城永通有限公司:S943001","湖南永通汽车销售服务有限公司:S743021","湖南华洋众广汽车销售服务有限公司:S743022","浏阳永通汽车销售服务有限公司:S743026","湖南长久博腾汽车销售服务有限公司:S743028","长沙大汉汽车贸易有限公司:S743030"],
            "怀化": ["怀化春茂汽车销售服务有限公司:S743019"],
            "益阳": ["益阳永通汽车销售服务有限公司:S743020"],
            "湘潭": ["湘潭东富汽车销售服务有限公司:S942033","湘潭市健车行汽车服务有限公司:S843001","湘乡湘健汽车服务有限公司:S243003"],
            "郴州": ["郴州永通汽车销售服务有限公司:S743023"],
            "株洲": ["株洲蓝马汽车销售服务有限公司:S743008","株洲市健车行汽车服务有限公司:S743024"],
            "常德": ["常德裕安贸易有限公司:S743010"],
            "衡阳": ["衡阳市西城汽车经贸有限公司:S743011","衡阳长久博华汽车销售服务有限公司:S743029"],
            "邵阳": ["邵阳市宝庆汽车超市有限公司:S743013"],
            "岳阳": ["湖南邦田汽车服务有限公司:S743014","岳阳大汉汽贸有限公司:S743031"],
            "吉首": ["湘西永通汽车销售服务有限公司:S743025"],
            "张家界": ["张家界永通汽车销售服务有限公司:S243001"],
            "岳阳": ["平江县邦田汽车服务有限公司:S243002"]
        },
        "广西": {
            "桂林": ["桂林鑫广达汽车销售服务有限责任公司:S745014"],
            "玉林": ["玉林市弘标汽车销售服务有限公司:S745016"],
            "贵港": ["贵港市弘捷汽车销售服务有限公司:S745019"],
            "河池": ["河池市弘捷汽车销售服务有限公司:S745018"],
            "柳州": ["柳州市盛铭汽车贸易有限公司:S745002","柳州鑫广达博腾汽车销售服务有限公司:S745020"],
            "南宁": ["广西鑫广达长久汽车商贸有限公司:S745015","广西弘捷汽车销售服务有限公司:S945001","广西鑫广达博冠汽车销售服务有限公司:S745021"]
        },
        "海南": {
            "海口": ["海南博世汽车服务有限公司:S746004","海南博众汽车销售有限公司:S746005"]
        },
        "四川": {
            "成都": ["东创建国汽车集团成都天弘车业有限公司:S751025","四川申蓉和浩汽车销售服务有限公司:S751026","成都启阳远航汽车销售服务有限公司:S751034","成都宏羽众信汽车销售服务有限公司:S751036","成都运通博恩汽车销售有限公司:S751033","四川长征汽车贸易有限公司:S751006","成都市强生实业有限责任公司:S751010","四川华星大众汽车销售服务有限公司:S751016","成都启新汽车服务有限责任公司:S751021","四川精典吉众汽车销售服务有限公司:S751022","四川一汽贸易有限责任公司:S951001","成都曙光汽车销售服务有限公司:S951005","崇州瑞龙汽车销售服务有限公司:S751037","成都汇和汽车销售有限公司:S751040","都江堰阔龙汽车销售服务有限公司:S751043","四川申蓉雅泰汽车销售服务有限公司:S751042","成都浩龙汽车销售服务有限公司:S751041","成都市泰鸿宇汽车贸易有限责任公司:S751044","四川金信华远汽车销售有限公司:S751047","成都汇腾汽车销售服务有限公司:S251003","成都广汇申蓉汇通汽车销售服务有限公司:S251004"],
            "眉山": ["四川省眉山市建国汽车有限公司:S751024","四川仁寿恒信汽车销售有限公司:S251001"],
            "乐山": ["乐山市华茂车业有限责任公司:S751018"],
            "自贡": ["自贡市和众汽车销售服务有限公司:S751027"],
            "泸州": ["泸州松明汽贸有限公司:S751019"],
            "攀枝花": ["攀枝花市力行工贸有限责任公司:S951012"],
            "内江": ["内江瑞龙汽车销售服务有限公司:S751038"],
            "德阳": ["德阳万路众悦汽车销售服务有限公司:S751028","德阳盛鸿汽车销售服务有限公司:S751030","四川德阳川西汽车销售服务有限公司:S751017","四川广汉恒达汽车销售有限公司:S251002"],
            "达州": ["达州市新世纪汽车销售服务有限公司:S751029"],
            "广元": ["广元建雄汽车销售服务有限公司:S751031"],
            "绵阳": ["绵阳景鸿汽车销售服务有限公司:S751032","绵阳市倍尔轿车服务有限公司:S751007"],
            "遂宁": ["遂宁市瑞胜汽车销售有限公司:S751035"],
            "南充": ["南充明云惠民车业有限公司:S751039","南充明云运行车业有限公司:S751045"],
            "资阳": ["资阳清巍茂源汽车销售服务有限公司:S751046"]
        },
        "陕西": {
            "西安": ["陕西东明汽车商行有限公司:S761013","陕西天一汽车销售服务有限责任公司:S761014","西安新白云汽车销售服务有限公司:S761020","陕西百佳汽车贸易有限公司:S761003","西安秦川唐都机电汽车配件销售有限公司:S761007","陕西鹰之杰汽车贸易有限公司:S761009","陕西尊荣致诚汽车贸易有限公司:S761024"],
            "榆林": ["榆林市恒源汽贸有限公司:S761015","榆林市恒丰汽贸有限公司:S761005","神木县恒捷汽贸有限公司:S761022","靖边县恒博汽贸有限公司:S261003","府谷县恒捷汽贸有限公司:S261004"],
            "安康": ["安康市庞大一众汽车销售有限公司:S761017"],
            "宝鸡": ["宝鸡市宝众汽车销售服务有限公司:S761016"],
            "汉中": ["汉中博通汽车销售服务有限公司:S761019"],
            "咸阳": ["咸阳恒丰汽贸有限公司:S761021"],
            "延安": ["延安市宝塔区黄泰有限责任公司:S761010"],
            "渭南": ["渭南佳燕汽车贸易有限公司:S761018"],
            "韩城": ["韩城市众瑞汽车销售有限责任公司:S261001"],
            "铜川": ["铜川新区黄泰汽车销售服务有限责任公司:S261002"]
        },
        "重庆": {
            "重庆": ["重庆百事达华博汽车销售服务有限公司:S755009","重庆龙华实业集团众华汽车销售服务有限公司:S755011","重庆龙华实业集团协众汽车销售服务有限公司:S755010","重庆商社汽车贸易有限公司:S755002","重庆龙华实业集团众友汽车销售服务有限公司:S755012","重庆盛驰汽车有限公司:S755013","重庆百事达华驰汽车销售服务有限公司:S255001","重庆商社众志渝涵汽车销售有限公司:S255002"]
        },
        "贵州": {
            "遵义": ["遵义市千汇汽车销售服务有限公司:S752002","遵义华来金汽车贸易有限公司:S752001"],
            "兴义": ["兴义市恒信众联汽车销售服务有限公司:S752003"],
            "安顺": ["安顺恒信众联汽车销售服务有限公司:S752005"],
            "贵阳": ["贵州利和汽车贸易有限公司:S952002","贵州汽车修理公司:S952003","贵州四扬汽车销售服务有限公司:S952007"],
            "黔东南苗族侗族自治州": ["凯里恒信众联汽车销售服务有限公司:S752004"],
            "六盘水": ["六盘水和通汽车销售服务有限公司:S752006"],
            "铜仁": ["铜仁恒信众联汽车销售服务有限公司:S752008"],
            "都匀": ["都匀恒信众联汽车销售服务有限公司:S752007"]
        },
        "新疆": {
            "乌鲁木齐": ["新疆庞大一众汽车销售服务有限公司:S765009","新疆汇捷汽车销售服务有限责任公司:S765007","新疆天汇华宇汽车销售服务有限责任公司:S765008","乌鲁木齐庞大腾众汽车销售有限公司:S765016"],
            "巴音郭楞蒙古自治州": ["库尔勒庞大一众汽车销售服务有限公司:S765010"],
            "喀什": ["喀什庞大一众汽车销售服务有限公司:S765011"],
            "哈密": ["哈密庞大一众汽车销售服务有限公司:S765012"],
            "昌吉回族自治州": ["昌吉市庞大一众汽车销售服务有限公司:S765014"],
            "克拉玛依": ["克拉玛依庞大一众汽车销售服务有限公司:S765015"],
            "阿克苏地区": ["阿克苏振宇汽车销售有限责任公司:S765005"],
            "石河子": ["石河子市大得汽车销售服务有限公司:S265001"]
        },
        "云南": {
            "大理州白族自治州": ["大理阿鹏有限责任公司:S753011"],
            "昆明": ["昆明谊众汽车销售有限公司:S753016","云南一汽工贸汽车销售服务有限公司:S753019","云南金鼎汽车贸易有限公司:S753021","云南云汽汽车销售服务有限公司:S753022","昆明涌鑫之众贸易有限公司:S753032","昆明捷通达汽车销售有限公司:S212003","安宁谊众汽车销售有限公司:S212004"],
            "楚雄": ["楚雄易通汽车销售服务有限公司:S753029"],
            "丽江": ["丽江恒盛通达汽车销售有限公司:S212001"],
            "玉溪": ["玉溪驰瑞汽车销售服务有限公司:S753023"],
            "红河": ["红河州鸿云汽车经贸有限公司:S753024","红河州捷鸿汽车经贸有限公司:S753031"],
            "西双版纳": ["西双版纳捷成通达汽车销售有限公司:S753026"],
            "曲靖": ["曲靖宝捷汽车销售有限公司:S753027","云南曲靖云鑫工贸有限公司:S753015","宣威市添福源汽车贸易有限公司:S212005"],
            "昭通": ["昭通市恒升汽车服务有限公司:S753025"],
            "保山": ["保山联通汽车销售维修有限责任公司:S753013"],
            "文山": ["文山捷惠汽车销售服务有限公司:S753030"],
            "临沧": ["临沧市添福源汽车贸易有限公司:S753033"],
            "普洱": ["普洱捷顺通达汽车销售服务有限公司:S753028"],
            "德宏": ["德宏龙泰通达汽车销售有限公司:S212002"]
        },
        "宁夏": {
            "银川": ["宁夏润众汽车销售服务有限公司:S764001","宁夏润之杰汽车销售服务有限责任公司:S764002","宁夏润之星汽车销售服务有限公司:S764003"],
            "石嘴山": ["石嘴山市朗宁汽车销售服务有限责任公司:S764004"],
            "吴忠": ["吴忠市润众汽车销售服务有限公司:S264001"]
        },
        "甘肃": {
            "嘉峪关": ["甘肃友好汽车服务有限责任公司:S762006"],
            "兰州": ["兰州庞大一众汽车销售服务有限公司:S762008","兰州新纪元汽车销售服务有限公司:S762012","兰州金盛强汽车销售有限公司:S762013","兰州金岛汽车销售有限公司:S762002"],
            "白银": ["白银庞大一众汽车销售服务有限公司:S762009"],
            "酒泉": ["酒泉金岛汽车销售服务有限公司:S762015"],
            "平凉": ["平凉润之杰汽车销售服务有限公司:S762016"],
            "武威": ["武威赛亚汇众汽车销售服务有限公司:S762018"],
            "金昌": ["金昌赛亚汇通汽车销售服务有限公司:S262001"],
            "临夏回族自治州": ["临夏州源通汽车销售有限公司:S262002"]
        },
        "青海": {
            "西宁": ["青海通瑞汽车贸易有限公司:S763002","青海海通汽车贸易有限公司:S763001"],
            "格尔木": ["格尔木宝瑞通汽车贸易有限公司:S263001"]
        },
        "西藏": {
            "拉萨": ["拉萨康达汽贸有限责任公司:S954001"]
        },
    };
    var placeholder = {
        p: '<option value="">省份</option>',
        c: '<option value="">城市</option>',
        d: '<option value="">经销商</option>'
    };
    var address = function(selector,provinces) {
        !provinces && (provinces = $.map(dealer,function(val,key) {return key}));
        var box = $(selector),
            cMap,
            pSelect = box.find("[name=province]")
                .html(placeholder.p)
                .on("change",function() {
                    cSelect.html(placeholder.c);
                    dSelect.html(placeholder.d);
                    if (this.value == "-1") {return};
                    cMap = dealer[this.value];
                    $.each(cMap,function(key) {
                        cSelect.append('<option value="' + key + '">' + key + '</option>');
                    });
                }),
            cSelect = box.find("[name=city]")
                .html(placeholder.c)
                .on("change",function() {
                    dSelect.html(placeholder.d);
                    this.value != "-1" && $.each(cMap[this.value],function(index,item) {
                        // item = item.split(":");
                        var name = item.split(":")[0];
                        dSelect.append('<option value="' + item + '">' + name + '</option>')
                    });
                }),
            dSelect = box.find("[name=dealer]")
                .html(placeholder.d);
        $.each(provinces,function(index,key) {
            (key in dealer) && pSelect.append('<option value="' + key + '">' + key + '</option>');
        });
    };
    $.address = address;
    // $._dealer = dealer;
    return address;
})(Zepto);















