

// 张树垚 2014-11-25 16:01:32 创建
// 宝马经销商列表
// 省 -> 市 -> 经销商

// HTML结构 -- name固定
// '<form action="" id="form">'
//  '<select name="province"></select>'
//  '<select name="city"></select>'
//  '<select name="dealer"></select>'
// '</form>'
// '<option value="-1">请选择 省</option>' -- 默认value是"-1"

// 用法
// 1.直接用：
// $.address("#form");
// 2.require：
// require(["address-zepto"],function(address) {
//  address("#form");
// });

// 第二个参数：选择要打印出的省份
// $.address("#form",["河北","河南"])

(function($) {
var dealer={
    "广东": {
        "江门": [
            "江门市蓬江区恒志汽车贸易有限公司"
        ],
        "佛山": [
            "佛山市恒通汽车贸易有限公司南海分公司",
            "佛山市顺肇汽车贸易有限公司"
        ],
        "深圳": [
            "深圳市东用实业发展有限公司",
            "深圳东风南方华瑞汽车销售服务有限公司",
            "深圳骏龙汽车销售服务有限公司"
        ],
        "珠海": [
            "珠海市广海汽车销售服务有限公司 "
        ],
        "中山": [
            "中山市广中汽车贸易有限公司"
        ],
        "东莞": [
            "东莞市祥兴汽车贸易有限公司"
        ],
        "汕头": [
            "汕头市里程汽车贸易有限公司"
        ],
        "河源": [
            "河源市源城区广发汽车贸易有限公司"
        ],
        "梅州": [
            "梅州市鹰广汽车修配有限公司"
        ],
        "揭阳": [
            "揭阳市里途汽车贸易销售有限公司"
        ],
        "惠州": [
            "惠州市灏源汽车贸易有限公司",
            "惠州市坤隆汽车销售服务有限公司"
        ],
        "清远": [
            "清远市成发汽车贸易有限公司",
            "清远市新长江汽车贸易有限公司"
        ],
        "韶关": [
            "韶关市骏威汽车贸易有限公司"
        ],
        "阳江": [
            "阳江市铭日汽车有限公司"
        ],
        "茂名": [
            "茂名京粤实业有限公司"
        ],
        "湛江": [
            "湛江市大众城汽车贸易有限公司"
        ],
        "肇庆": [
            "肇庆万利通汽车贸易有限公司"
        ]
    },
    "浙江": {
        "杭州": [
            "浙江友佳汽车有限公司萧山分公司"
        ],
        "湖州": [
            "浙江友佳汽车有限公司湖州分公司"
        ],
        "嘉兴": [
            "嘉兴市骏驰汽车销售有限公司",
            "嘉兴骏豪汽车销售服务有限公司"
        ],
        "温州": [
            "温州豪通汽车有限公司"
        ],
        "宁波": [
            "宁波元通元佳汽车有限公司",
            "宁波市江北元通汽车销售有限公司"
        ],
        "舟山": [
            "舟山市申之达汽车销售服务有限公司"
        ],
        "金华": [
            "金华物产汽车销售服务有限公司永康分公司",
            "金华物产汽车销售服务有限公司"
        ],
        "绍兴": [
            "绍兴元佳汽车有限公司"
        ],
        "慈溪": [
            "慈溪大申进口汽车服务有限公司"
        ],
        "丽水": [
            "金华物产汽车销售服务有限公司丽水分公司"
        ],
        "衢州": [
            "衢州华泰汽车有限公司"
        ]
    },
    "甘肃": {
        "兰州": [
            "甘肃郑州日产汽车销售有限公司"
        ],
        "酒泉": [
            "酒泉市恒源通汽车销售有限责任公司"
        ]
    },
    "宁夏": {
        "银川": [
            "宁夏大世界明珠汽车销售服务有限公司"
        ]
    },
    "内蒙": {
        "呼和浩特": [
            "内蒙古恒安汽车贸易有限公司"
        ],
        "鄂尔多斯": [
            "鄂尔多斯市海成汽车贸易有限公司"
        ],
        "巴彦淖尔": [
            "巴彦淖尔市途瑞汽车贸易有限责任公司"
        ],
        "包头": [
            "包头市永捷汽车销售有限责任公司"
        ],
        "锡林浩特市": [
            "锡林浩特市顺达亚飞汽车贸易有限责任公司"
        ],
        "通辽": [
            "通辽市众志鑫汽车贸易有限公司通辽市第三专营店"
        ],
        "佳木斯": [
            "佳木斯佳通汽车销售服务有限公司"
        ],
        "呼伦贝尔": [
            "呼伦贝尔市合众汽车贸易有限责任公司"
        ],
        "大庆": [
            "大庆市宏益达汽车销售有限公司"
        ]
    },
    "山西": {
        "太原": [
            "山西汇通达汽车销售服务有限公司",
            "山西永安汽车销售有限公司"
        ],
        "大同": [
            "大同市正日物资贸易有限责任公司"
        ],
        "运城": [
            "运城市元通双润汽车销售服务有限公司"
        ],
        "临汾": [
            "临汾市尧嘉汽车贸易有限公司"
        ]
    },
    "云南": {
        "曲靖": [
            "曲靖建丰汽车销售服务有限公司"
        ],
        "个旧": [
            "个旧明柏汽车销售服务有限公司"
        ],
        "景洪": [
            " 西双版纳乐景汽车销售服务有限公司"
        ],
        "大理": [
            "大理乐诏汽车销售服务有限公司"
        ],
        "普洱": [
            "普洱乐途汽车销售服务有限公司"
        ]
    },
    "贵州": {
        "贵阳": [
            "贵州钟裕汽车有限公司"
        ],
        "遵义": [
            "贵州钟裕汽车有限公司遵义分公司"
        ]
    },
    "陕西": {
        "西安": [
            "陕西华越汽车配件维修有限责任公司",
            "陕西郑州日产汽车销售服务有限公司"
        ],
        "汉中": [
            "汉中市荣腾汽车贸易有限责任公司"
        ],
        "延安": [
            "延安新兴有限责任公司"
        ],
        "榆林": [
            "榆林市华辰商贸有限公司"
        ]
    },
    "福建": {
        "福州": [
            "福州东瑞汽车销售服务有限公司"
        ],
        "厦门": [
            "厦门金汇海汽车服务有限公司 "
        ],
        "漳州": [
            "漳州市卓信汽车贸易有限公司"
        ],
        "晋江": [
            "晋江市四海汽车贸易有限公司"
        ],
        "邵武": [
            "邵武市龙祥汽车贸易有限公司"
        ],
        "三明": [
            "三明市成华汽车贸易有限公司"
        ]
    },
    "江西": {
        "南昌": [
            "江西华新"
        ]
    },
    "江苏": {
        "南京": [
            "南京润豫兴苏汽车销售有限公司",
            "江苏新奥通汽车销售服务有限公司"
        ],
        "镇江": [
            "镇江天安达汽车贸易有限公司"
        ],
        "常州": [
            "常州广达汽车销售服务有限公司"
        ],
        "扬州": [
            "扬州骏豪汽车销售服务有限公司"
        ],
        "淮安": [
            "淮安雨田投资集团有限公司"
        ],
        "盐城": [
            "盐城苏缘汽车贸易有限公司"
        ],
        "南通": [
            "江苏太平洋汽车集团有限公司"
        ],
        "连云港": [
            "连云港宁海轿车销售服务有限公司"
        ]
    },
    "吉林": {
        "延吉": [
            "延边华龙汽车销售服务有限公司"
        ]
    },
    "辽宁": {
        "沈阳": [
            "辽宁广和通汽车销售服务有限公司"
        ],
        "赤峰": [
            "赤峰岚迪汽车服务有限责任公司"
        ],
        "鞍山": [
            "鞍山正日通汽车销售服务有限公司"
        ],
        "盘锦": [
            "盘锦市汽车销售总公司"
        ]
    },
    "湖南": {
        "邵阳": [
            "邵阳市雄兴汽车贸易有限公司"
        ],
        "株洲": [
            "株洲鸿祥汽车销售有限公司"
        ],
        "长沙": [
            "湖南品琦汽车服务有限公司"
        ],
        "岳阳": [
            "岳阳圣隆汽车贸易有限公司"
        ],
        "郴州": [
            "郴州市君豪汽车销售有限责任公司"
        ],
        "衡阳": [
            "衡阳市恒昆汽车贸易有限公司"
        ]
    },
    "重庆": {
        "重庆": [
            "重庆商社强力汽车贸易有限公司"
        ]
    },
    "河南": {
        "郑州": [
            "河南神风汽车销售有限公司"
        ],
        "南阳": [
            "南阳天尊汽车销售服务有限公司"
        ],
        "濮阳": [
            "濮阳市瑞璞机电设备有限公司"
        ],
        "商丘": [
            "商丘瑞鑫汽车销售服务有限公司"
        ],
        "焦作": [
            "焦作市驰骋汽车销售服务有限公司"
        ],
        "许昌": [
            "许昌恒力汽车销售服务有限公司"
        ],
        "漯河": [
            "漯河市华益汽车销售服务有限公司"
        ],
        "开封": [
            "开封市盛铭汽车贸易有限公司"
        ]
    },
    "新疆": {
        "乌鲁木齐": [
            "新疆亚中（郑州）日产汽车销售有限公司",
            "新疆振华汽车销售有限公司"
        ],
        "库尔勒": [
            "新疆弘瑞华博汽车销售运输有限公司库尔勒分公司"
        ],
        "哈密": [
            "哈密新华夏中力汽车连锁有限责任公司"
        ],
        "克拉玛依": [
            "克拉玛依市永庆工贸有限责任公司"
        ]
    },
    "西藏": {
        "西宁": [
            "青海合众汽车贸易有限公司",
            "青海新源众成汽车销售服务有限公司"
        ],
        "拉萨": [
            "拉萨康达汽贸有限责任公司"
        ]
    },
    "海南": {
        "海口": [
            "海南合众郑州日产汽车销售有限公司"
        ],
        "三亚": [
            "三亚万里行汽车销售有限责任公司"
        ]
    },
    "四川": {
        "德阳": [
            "德阳森发汽车贸易有限公司"
        ],
        "绵阳": [
            "绵阳鑫晟汽车销售服务有限公司"
        ],
        "攀枝花": [
            "攀枝花众鹏汽车销售服务有限责任公司"
        ],
        "成都": [
            "四川润东汽车销售服务有限公司",
            "四川华信汽车销售有限责任公司"
        ],
        "泸州": [
            "泸州市万达汽车贸易有限公司"
        ],
        "南充": [
            "四川浩通汽车贸易有限公司"
        ],
        "宜宾": [
            "宜宾松源汽车销售服务有限公司"
        ],
        "乐山": [
            "乐山市联合润东汽车销售服务有限公司"
        ],
        "达州": [
            "达州市灵通青山汽车销售服务有限公司"
        ],
        "广元": [
            "广元市智宸汽贸有限公司"
        ]
    },
    "山东": {
        "济南": [
            "山东日产金龙汽车销售服务有限公司"
        ],
        "临沂": [
            "山东瑞昌汽车贸易有限公司"
        ],
        "菏泽": [
            "菏泽泽源汽车销售服务有限公司"
        ],
        "淄博": [
            "淄博航天锦诚汽车销售服务有限公司"
        ],
        "枣庄": [
            "枣庄远方汽车销售服务有限公司"
        ],
        "滨州": [
            "滨州市同正德汽车销售服务有限公司"
        ],
        "日照": [
            "日照市东方汽车贸易有限公司"
        ],
        "威海": [
            "威海坤成汽车销售有限公司"
        ],
        "东营": [
            "东营光达机械修理有限公司"
        ],
        "潍坊": [
            "潍坊达喀尔汽车销售服务有限公司"
        ],
        "烟台": [
            "烟台世烨"
        ]
    },
    "安徽": {
        "合肥": [
            "安徽伟业汽车销售有限公司",
            "安徽徽安汽车服务有限公司"
        ],
        "亳州": [
            "亳州德鑫汽车销售服务有限公司"
        ]
    },
    "北京": {
        "北京": [
            "北京森华佳运汽车贸易有限公司"
        ]
    },
    "天津":{
        "天津": [
            "天津市浩物机电汽车贸易有限公司"
        ]
    },
    "河北": {
        "邯郸": [
            "邯郸市华信汽车贸易有限公司"
        ],
        "邢台": [
            "邢台市蓝池泰龙汽车销售服务有限公司"
        ],
        "沧州": [
            "沧州市大道汽车销售有限公司"
        ],
        "唐山": [
            "唐山市庞大浩翔汽车销售服务有限公司"
        ],
        "秦皇岛": [
            "秦皇岛盛驰商贸有限公司"
        ]
    },
    "上海": {
        "上海": [
            "上海天驰汽车销售服务有限公司",
            "上海浦东机械设备成套有限公司"
        ]
    },
    "湖北": {
        "武汉": [
            "湖北三环鑫通汽车销售有限公司"
        ],
        "宜昌": [
            "宜昌交运集团麟觉汽车销售服务有限公司"
        ]
    }
}
    var placeholder = {
        p: '<option value="">省份</option>',
        c: '<option value="">城市</option>',
        d: '<option value="">经销商</option>'
    };
    var address = function(selector,provinces) {
        !provinces && (provinces = $.map(dealer,function(val,key) {return key}));
        var box = $(selector),
            cMap,
            pSelect = box.find("[name=province]")
                .html(placeholder.p)
                .on("change",function() {
                    cSelect.html(placeholder.c);
                    dSelect.html(placeholder.d);
                    if (this.value == "-1") {return};
                    cMap = dealer[this.value];
                    $.each(cMap,function(key) {
                        cSelect.append('<option value="' + key + '">' + key + '</option>');
                    });
                }),
            cSelect = box.find("[name=city]")
                .html(placeholder.c)
                .on("change",function() {
                    dSelect.html(placeholder.d);
                    this.value != "-1" && $.each(cMap[this.value],function(index,item) {
                        // item = item.split(":");
                        var name = item.split(":")[0];
                        dSelect.append('<option value="' + item + '">' + name + '</option>')
                    });
                }),
            dSelect = box.find("[name=dealer]")
                .html(placeholder.d);
        $.each(provinces,function(index,key) {
            (key in dealer) && pSelect.append('<option value="' + key + '">' + key + '</option>');
        });
    };
    $.address = address;
    // $._dealer = dealer;
    return address;
})($);
















