var dealers={
    "浙江": {
        "杭州": [
            "浙江奥通汽车有限公司",
            "浙江利华汽车销售有限公司",
            "杭州德奥汽车有限公司",
            "浙江和诚滨奥汽车有限公司",
            "浙江百得利汽车有限公司",
            "浙江奥达通汽车销售有限 ",
            "浙江康桥锦澳汽车销售服务有限公司",
            "杭州富阳奥达汽车销售服务有限公司",
            "杭州捷骏汽车销售服务有限公司",
            "杭州德奥城西汽车有限公司",
            "杭州运通和晟汽车销售服务有限公司"
        ],
        "湖州": [
            "湖州奥通汽车有限公司",
            "湖州永达汽车服务有限公司",
            "长兴奥长汽车销售服务有限公司"
        ],
        "嘉兴": [
            "嘉兴市金奥兰汽车销售服务有限公司",
            "嘉兴市永奥汽车销售服务有限公司",
            "海宁新奥汽车销售服务有限公司",
            "桐乡德奥汽车有限公司"
        ],
        "金华": [
            "金华博奥汽车贸易有限公司",
            "义乌市奥龙汽车销售有限公司",
            "浙江永奥汽车销售有限公司",
            "义乌市博奥汽车销售服务有限公司",
            "金华东奥汽车贸易有限公司",
            "东阳德奥汽车销售服务有限公司"
        ],
        "丽水": [
            "丽水市嘉诚汽车销售有限公司"
        ],
        "宁波": [
            "宁波润达汽车销售服务有限公司",
            "宁波国奥达汽车销售有限公司",
            "浙江康桥科奥汽车有限公司",
            "宁波康桥锦澳汽车销售服务有限公司",
            "余姚物产元通汽车有限公司",
            "宁波中基汽车销售服务有限公司",
            "慈溪市驰奥汽车销售有限公司",
            "宁波国奥汽车销售有限公司",
            "宁波恒迪汽车销售服务有限公司"
        ],
        "衢州": [
            "衢州君悦佳奥汽车有限公司"
        ],
        "绍兴": [
            "浙江绍兴联奥汽车销售服务有限公司",
            "绍兴宝利德汽车有限公司",
            "绍兴市汇奥汽车销售服务有限公司",
            "绍兴兴奥汽车销售服务有限公司",
            "嵊州奥泽汽车销售服务有限公司"
        ],
        "台州": [
            "温岭金奥达汽车销售服务有限公司",
            "台州奥曦汽车销售服务有限公司",
            "台州和诚临奥汽车有限公司",
            "台州永达奥诚汽车销售服务有限公司",
            "台州中升晨隆汽车销售服务有限公司",
            "台州和奥汽车销售服务有限公司"
        ],
        "温州": [
            "温州瓯通汽车有限公司",
            "温州联奥汽车销售服务有限公司",
            "乐清市红源汽车销售服务有限公司",
            "温州红源汽车销售服务有限公司",
            "温州滨奥汽车销售服务有限公司",
            "苍南奥通汽车有限公司",
            "温州中升华奥汽车销售服务有限公司",
            "温州首汽腾骏汽车销售服务有限公司"
        ],
        "舟山": [
            "舟山轿晨润达汽车销售服务有限公司"
        ]
    }
}