var dealers={
    "黑龙江省|1": {
        "哈尔滨市|1": [
            "哈尔滨新纪元|A0501",
            "哈尔滨融展东日|A0503",
            "哈尔滨运通俊奥|A0505",
            "哈尔滨融展兴邦|A0506"
        ],
        "大庆市|2": [
            "大庆天创|A0511",
            "大庆易盛|A0513",
            "大庆勤华瑞嘉|A0518"
        ],
        "佳木斯市|7": [
            "佳木斯运通|A0512",
            "佳木斯凯华运通|A0526"
        ],
        "牡丹江市|8": [
            "牡丹江佰佳|A0515"
        ],
        "齐齐哈尔|10": [
            "齐齐哈尔瑞迪|A0516",
            "齐齐哈尔华宇瑞通|A0521"
        ],
        "绥化市|12": [
            "绥化融展绥鑫|A0517"
        ],
        "双鸭山市|11": [
            "双鸭山凯华运通|A0520"
        ],
        "七台河市|9": [
            "七台河隆达金信|A0522"
        ],
        "鸡西市|6": [
            "鸡西勤华俊达|A0523"
        ],
        "鹤岗市|4": [
            "鹤岗凯华运通东山|A0525"
        ]
    },
    "吉林省|2": {
        "长春市|14": [
            "长春金达洲凯绅|A0601",
            "长春瑞孚|A0602",
            "长春金达洲恒瑞|A0603",
            "长春恒源|A0606",
            "长春融展长沈路专营店|A0607"
        ],
        "吉林市|17": [
            "吉林瑞孚环宇|A0611",
            "四平申达|A0615",
            "吉林融展瑞合|A0616"
        ],
        "延吉市|22": [
            "延吉瑞孚隆兴|A0612"
        ],
        "松原市|20": [
            "松原金达洲|A0613"
        ],
        "通化市|21": [
            "通化孚胜达|A0617"
        ],
        "辽源市|18": [
            "辽源融展鑫源|A0618"
        ],
        "白山市|16": [
            "白山名车汇华鑫|A0620"
        ]
    },
    "辽宁省|3": {
        "沈阳市|23": [
            "沈阳东北汽贸|A0901",
            "沈阳新世纪|A0902",
            "沈阳中升捷通|A0905",
            "沈阳汇丰沈大|A0906",
            "辽宁东辰汽车销售服务有限公司|A0907",
            "沈阳中升越通|A0908"
        ],
        "大连市|27": [
            "大连华圣|A0911",
            "大连中升奥通|A0912",
            "大连中升搏通|A0919",
            "大连英和保税区|A0926",
            "大连中升大通|A0930",
            "大连华凯|A0931"
        ],
        "葫芦岛市|31": [
            "葫芦岛川达|A0913"
        ],
        "鞍山市|24": [
            "鞍山亿通东尼|A0915",
            "鞍山亿通东亿|A0928"
        ],
        "锦州市|32": [
            "锦州维立达|A0916"
        ],
        "营口市|36": [
            "营口英和大通|A0917"
        ],
        "盘锦市|34": [
            "盘锦英和|A0918"
        ],
        "朝阳市|26": [
            "朝阳百盛|A0920"
        ],
        "丹东市|28": [
            "丹东英和花园|A0921"
        ],
        "辽阳市|33": [
            "辽阳亿通日成|A0922"
        ],
        "本溪市|25": [
            "本溪英和卧龙|A0923"
        ],
        "阜新市|30": [
            "阜新全一|A0925"
        ],
        "铁岭市|35": [
            "铁岭英和凡河|A0927"
        ],
        "抚顺市|29": [
            "抚顺东北汽贸瑞晟|A0929"
        ]
    },
    "北京市|10": {
        "北京市|462": [
            "北京华盛昌|B0101",
            "北京汇京鸿运|B0102",
            "北京东风南方三合|B0103",
            "北京东风南方亮马|B0104",
            "北京中汽雷日|B0106",
            "北京森华佳运|B0107",
            "北京福源|B0108",
            "北京宏远信诚|B0109",
            "北京华盛昌百旺|B0110",
            "北京汇京世纪|B0112",
            "北京通和盛远|B0113",
            "北京东方华中|B0118",
            "北京浩洋正业|B0119",
            "北京鑫达润城|B0120",
            "北京海润嘉|B0121",
            "北京冀东兴|B0122",
            "北京汇京福瑞|B0123",
            "北京航天正通|B0125",
            "北京惠通(北京五元桥)|B0126",
            "北京祥瑞聚鑫(北京马池口)|B0127",
            "北京东风南方大成(北京欧德宝汽车城)|B0129",
            "北京晟通(北京房山)|B0130"
        ]
    },
    "天津市|14": {
        "天津市|463": [
            "天津长江|B0201",
            "天津新濠|B0202",
            "天津津日|B0203",
            "天津新骏濠|B0205",
            "天津名濠|B0206",
            "天津滨海|B0207",
            "天津名宣|B0209",
            "天津名达|B0210",
            "天津浩物武清|B0213"
        ]
    },
    "内蒙古|5": {
        "呼和浩特市|51": [
            "呼和浩特鼎杰|B0701",
            "呼和浩特鼎泽|B0702",
            "呼和浩特利丰泰津|B0703"
        ],
        "包头市|53": [
            "包头金达|B0711",
            "包头东信鑫达|B0718"
        ],
        "鄂尔多斯市|55": [
            "鄂尔多斯银达|B0712"
        ],
        "赤峰市|54": [
            "赤峰世鹏|B0713",
            "赤峰金鹏|B0726"
        ],
        "巴彦淖尔|471": [
            "巴彦淖尔东信泰达|B0716"
        ],
        "呼伦贝尔市|56": [
            "呼伦贝尔庞大广源|B0717"
        ],
        "锡林浩特市|62": [
            "锡林浩特嘉洋|B0719"
        ],
        "通辽市|59": [
            "通辽利丰泰昌|B0721",
            "通辽龙兴伟业|B0727"
        ],
        "兴安盟|483": [
            "兴安盟华楠|B0722",
            "兴安盟利龙扎旗|B0728"
        ],
        "乌兰察布|61": [
            "乌兰察布利丰泰昌|B0725"
        ]
    },
    "河北省|11": {
        "石家庄市|114": [
            "石家庄华信(石家庄新华)|B1001",
            "石家庄恒辰|B1002",
            "石家庄海悦|B1003",
            "石家庄联德|B1005",
            "石家庄恒凯|B1006"
        ],
        "唐山市|122": [
            "唐山冀东|B1011",
            "唐山冀龙|B1019",
            "唐山佳源|B1028",
            "唐山汇京唐信|B1034"
        ],
        "保定市|115": [
            "保定力宏|B1012",
            "保定轩宇久久|B1025",
            "高碑店庞大庆源|B1035",
            "保定东风南方和顺|B1036",
            "保定东风南方涿州|B1043",
            "保定东风南方定州|B1046"
        ],
        "秦皇岛市|121": [
            "秦皇岛佳浩|B1013",
            "秦皇岛京德|B1031"
        ],
        "廊坊市|120": [
            "廊坊乐业|B1015",
            "廊坊庞大铭顺|B1041"
        ],
        "邯郸市|118": [
            "邯郸富信|B1016",
            "邯郸华腾|B1022",
            "邯郸恒信东顺|B1032",
            "邯郸东风南方武安|B1045"
        ],
        "邢台市|123": [
            "邢台圣士龙|B1017",
            "邢台蓝池成龙|B1029",
            "邢台蓝池桂龙|B1047"
        ],
        "沧州市|116": [
            "沧州佳鑫|B1020",
            "沧州瑞鑫|B1027",
            "沧州东风南方沧运|B1033",
            "沧州东风南方任丘|B1039"
        ],
        "衡水市|119": [
            "衡水伴福|B1021",
            "衡水蓝池泽龙桃城|B1037"
        ],
        "张家口市|124": [
            "张家口华联腾飞|B1023",
            "张家口庞大张宣路|B1042"
        ],
        "承德市|117": [
            "承德庞大飞源|B1026"
        ]
    },
    "山西省|13": {
        "长治市|144": [
            "长治东升|B1018",
            "长治蓝池冠龙|B1122"
        ],
        "太原市|142": [
            "太原大源|B1102",
            "太原汇泽|B1106",
            "太原东润|B1107",
            "太原东汇|B1108"
        ],
        "大同市|143": [
            "大同云岗|B1103",
            "大同东昊|B1125"
        ],
        "临汾市|147": [
            "临汾东盛源|B1111",
            "临汾新盛源|B1119"
        ],
        "晋城市|145": [
            "晋城华洋|B1112"
        ],
        "运城市|151": [
            "运城万通|B1113",
            "运城瑞盈|B1121",
            "运城瑞盈河津|B1128"
        ],
        "阳泉市|150": [
            "阳泉永阳|B1115"
        ],
        "晋中市|146": [
            "晋中东风南方汇盛|B1116",
            "晋中汇隆|B1123"
        ],
        "朔州市|148": [
            "朔州汇海|B1117",
            "怀仁云山|B1129"
        ],
        "忻州市|149": [
            "忻州晋昌|B1118"
        ],
        "吕梁|152": [
            "吕梁昌源|B1120",
            "吕梁庞大孝义鸿源|B1126"
        ]
    }
}
function linkage(sel1,sel2,sel3,arr){
    var placeholder1="请选择";
    var placeholder2="请选择";
    var placeholder3="请选择";
    if(arguments.length==3){
        arr=sel3;
    }else if(arguments.length==4){
        sel3.html("");
        sel3.append('<option value="">'+ placeholder3 +'</option>');
    }

    var sel1v=$.map(arr,function(val,key){return key})
    // 将sel1的option放入
    sel1.html("");
    sel1.append('<option value="">'+ placeholder1 +'</option>')
    $.each(arr,function(i){
        var ishow=i.split('|')[0];
        sel1.append("<option value="+ i +">"+ ishow +"</option>")
    })

    // 将sel1第一项对应sel2的option放入
    sel2.html("");
    sel2.append('<option value="">'+ placeholder2 +'</option>');


    // sel1 change事件开始联动 2级联动
    if(arguments.length==3){
        sel1.on('change',function(){
            var index=sel1.get(0).selectedIndex-1;
            if(index<0){index=0};
            $.each(sel1v,function(i){
                sel2.html("");
                sel2.append('<option value="">'+ placeholder2 +'</option>')
                $.each(arr[sel1v[index]],function(j){
                    sel2.append("<option value="+ arr[sel1v[index]][j] +">"+ arr[sel1v[index]][j] +"</option>")
                })
            })
            if(index==0){sel2.append('<option value="">'+ placeholder2 +'</option>')}
        })
    }
    // sel1 change事件开始联动 3级联动
    if(arguments.length==4){
        sel1.on('change',function(){
            var index=sel1.get(0).selectedIndex-1;
            if(index<0){index=0};
            var sel2v=$.map(arr[sel1v[index]],function(val,key){return key});
            sel2.html("");
            sel2.append('<option value="">'+ placeholder2 +'</option>')
            sel3.html("");
            sel3.append('<option value="">'+ placeholder3 +'</option>')
            $.each(sel2v,function(i){
                var sel2vshow=sel2v[i].split('|')[0];
                sel2.append("<option value="+ sel2v[i] +">"+ sel2vshow +"</option>")
            })
            // if(index==0){sel2.append('<option value="">'+ placeholder2 +'</option>')}
        })
        sel2.on('change',function(){
            var index2=sel2.get(0).selectedIndex-1;
            var index=sel1.get(0).selectedIndex-1;
            if(index<0){index=0};
            if(index2<0){index2=0};
            var sel2v=$.map(arr[sel1v[index]],function(val,key){return key})
            var sel3v=arr[sel1v[index]][sel2v[index2]];
            sel3.html("");
            sel3.append('<option value="">'+ placeholder3 +'</option>')
            $.each(sel3v,function(i){
                var value3=sel3v[i];
                var option3=sel3v[i].split("|")[0];
                sel3.append("<option value="+ value3 +">"+ option3 +"</option>")
            })
            // if(index2==0){sel3.append('<option value="">'+ placeholder3 +'</option>')}
        })
    }
}